[
  "What 8-K current reports did Google submit this year?",
  "Show me Salesforce's 10-Q quarterly filings in 2023",
  "Compare amendment patterns between Google and Tesla",
  "Compare amendment patterns between Apple and Johnson & Johnson",
  "Which company filed more amendments: Apple or Netflix?",
  "List all Coca-Cola filings within 90 days of fiscal year end",
  "Which filed their 10-K earlier: Google or Netflix?",
  "When did Bank of America file its last 10-K annual report?",
  "Show me Bank of America's 10-Q quarterly filings in 2023",
  "What 8-K current reports did Johnson & Johnson submit this year?",
  "Show me all Home Depot SEC filings in chronological order",
  "Show me 8-K filing frequency comparison: Apple vs Oracle",
  "Compare Google and Tesla's SEC filing schedules",
  "What amendments did PepsiCo file in 2023?",
  "When did Goldman Sachs file its last 10-K annual report?",
  "When did AbbVie file its annual report for fiscal year 2023?",
  "Which company has more consistent filing timing: Apple or Adobe?",
  "Find companies that filed proxy statements earliest in 2023",
  "What amendments did Amazon file in 2023?",
  "Show me the filing timeline comparison between Apple and Oracle",
  "Which filed their 10-K earlier: Apple or Qualcomm?",
  "Compare proxy statement filing dates for Apple and Salesforce",
  "Show me Morgan Stanley's quarterly filing timeline for 2022",
  "Compare proxy statement filing dates for Apple and Intel",
  "When did Home Depot file its annual report for fiscal year 2023?",
  "When was Wells Fargo's most recent proxy statement filed?",
  "Show me the sequence of filings leading up to major corporate events",
  "Which company has more consistent filing timing: Apple or Qualcomm?",
  "Show me companies with irregular SEC filing patterns",
  "Compare amendment patterns between Apple and AMD",
  "What was JPMorgan's filing pattern during Q4 2023?",
  "Find all filings submitted exactly on the deadline day",
  "When was Microsoft's most recent proxy statement filed?",
  "Which company filed more amendments: Google or Microsoft?",
  "Show me all Oracle SEC filings in chronological order",
  "Show me Wells Fargo's 10-Q quarterly filings in 2023",
  "Show me the filing timeline comparison between Apple and Johnson & Johnson",
  "When was Intel's most recent proxy statement filed?",
  "When did Goldman Sachs file its annual report for fiscal year 2023?",
  "When did Home Depot file its last 10-K annual report?",
  "Show me Johnson & Johnson's quarterly filing timeline for 2022",
  "Compare amendment patterns between Apple and Google",
  "Which company filed more amendments: Apple or Wells Fargo?",
  "Show me PepsiCo's 10-Q quarterly filings in 2023",
  "When did Salesforce file its annual report for fiscal year 2023?",
  "Which filed their 10-K earlier: Apple or Google?",
  "Which filed their 10-K earlier: Google or Tesla?",
  "List all Procter & Gamble filings within 90 days of fiscal year end",
  "When did Intel file its last 10-K annual report?",
  "What amendments did Procter & Gamble file in 2023?",
  "Show me Merck's 10-Q quarterly filings in 2023",
  "Which companies had the most SEC filing deadline violations?",
  "Find companies with the shortest time between fiscal year end and 10-K filing",
  "When did Apple file its annual report for fiscal year 2023?",
  "Show me 8-K filing frequency comparison: Apple vs Morgan Stanley",
  "Which filed their 10-K earlier: Apple or Goldman Sachs?",
  "Show me the filing timeline comparison between Apple and Tesla",
  "Which company has more consistent filing timing: Apple or Microsoft?",
  "List all Goldman Sachs filings within 90 days of fiscal year end",
  "When did Procter & Gamble file its annual report for fiscal year 2023?",
  "Which companies filed during holiday periods or market closures?",
  "What amendments did Home Depot file in 2023?",
  "Compare amendment patterns between Apple and Intel",
  "Which filed their 10-K earlier: Apple or Tesla?",
  "Show me 8-K filing frequency comparison: Google vs Amazon",
  "When did Oracle file its last 10-K annual report?",
  "What 8-K current reports did Salesforce submit this year?",
  "Show me Adobe's quarterly filing timeline for 2022",
  "Which company filed more amendments: Apple or Johnson & Johnson?",
  "What was Qualcomm's filing pattern during Q4 2023?",
  "What amendments did Coca-Cola file in 2023?",
  "What amendments did Intel file in 2023?",
  "Which company has more consistent filing timing: Apple or Oracle?",
  "When did AbbVie file its last 10-K annual report?",
  "Show me companies that filed late notices (NT forms)",
  "What amendments did Salesforce file in 2023?",
  "When did Intel file its annual report for fiscal year 2023?",
  "Compare proxy statement filing dates for Apple and Tesla",
  "When was Johnson & Johnson's most recent proxy statement filed?",
  "What amendments did Meta file in 2023?",
  "Show me NVIDIA's 10-Q quarterly filings in 2023",
  "When did Netflix file its annual report for fiscal year 2023?",
  "Show me companies that filed early versus exactly on deadline",
  "Show me all Google SEC filings in chronological order",
  "Which company filed more amendments: Apple or Qualcomm?",
  "Compare proxy statement filing dates for Google and Microsoft",
  "Show me 8-K filing frequency comparison: Google vs Meta",
  "What amendments did UnitedHealth file in 2023?",
  "What 8-K current reports did JPMorgan submit this year?",
  "Show me all Merck SEC filings in chronological order",
  "Show me 8-K filing frequency comparison: Apple vs Wells Fargo",
  "Show me Netflix's 10-Q quarterly filings in 2023",
  "Which companies filed extensions for their annual reports?",
  "Compare proxy statement filing dates for Apple and Bank of America",
  "Which companies filed proxy statements closest to annual meeting dates?",
  "Show me 8-K filing frequency comparison: Apple vs Qualcomm",
  "Which filed their 10-K earlier: Google or Amazon?",
  "List all JPMorgan filings within 90 days of fiscal year end",
  "What 8-K current reports did PepsiCo submit this year?",
  "Show me Amazon's 10-Q quarterly filings in 2023",
  "Show me the filing timeline comparison between Apple and Meta",
  "Show me 8-K filing frequency comparison: Apple vs Google",
  "Find companies with the most consistent quarterly filing schedules",
  "Show me NVIDIA's quarterly filing timeline for 2022",
  "Show me Apple's 10-Q quarterly filings in 2023",
  "When did Tesla file its last 10-K annual report?",
  "Show me Home Depot's 10-Q quarterly filings in 2023",
  "Show me UnitedHealth's quarterly filing timeline for 2022",
  "Show me Morgan Stanley's 10-Q quarterly filings in 2023",
  "Which companies filed registration statements before major announcements?",
  "What 8-K current reports did Walmart submit this year?",
  "Compare Google and Microsoft's SEC filing schedules",
  "Find patterns in weekend vs weekday SEC filings",
  "When did Adobe file its last 10-K annual report?",
  "Which company filed more amendments: Google or Tesla?",
  "Show me Apple's quarterly filing timeline for 2022",
  "Which companies filed the most current reports (8-K) in a single quarter?",
  "List all Bank of America filings within 90 days of fiscal year end",
  "Compare Apple and Meta's SEC filing schedules",
  "What amendments did Adobe file in 2023?",
  "Which company filed more amendments: Google or Netflix?",
  "Find companies with the shortest time from fiscal year end to 10-K filing",
  "Show me the filing timeline comparison between Apple and JPMorgan",
  "Find companies that switched from large accelerated to accelerated filer status",
  "When did Coca-Cola file its annual report for fiscal year 2023?",
  "What was Merck's filing pattern during Q4 2023?",
  "Compare amendment patterns between Apple and Morgan Stanley",
  "Show me 8-K filing frequency comparison: Apple vs Bank of America",
  "Compare Google and Netflix's SEC filing schedules",
  "List all PepsiCo filings within 90 days of fiscal year end",
  "When was Merck's most recent proxy statement filed?",
  "Show me AbbVie's quarterly filing timeline for 2022",
  "What was UnitedHealth's filing pattern during Q4 2023?",
  "List all NVIDIA filings within 90 days of fiscal year end",
  "What amendments did Morgan Stanley file in 2023?",
  "Which companies had the longest gap between consecutive 10-Q filings?",
  "Which company has more consistent filing timing: Google or Netflix?",
  "What 8-K current reports did Pfizer submit this year?",
  "Compare amendment patterns between Apple and Microsoft",
  "What 8-K current reports did Tesla submit this year?",
  "Compare proxy statement filing dates for Apple and Amazon",
  "Find patterns in accelerated vs non-accelerated filer deadlines",
  "Show me Coca-Cola's quarterly filing timeline for 2022",
  "Compare Apple and Microsoft's SEC filing schedules",
  "When was Google's most recent proxy statement filed?",
  "When did Qualcomm file its last 10-K annual report?",
  "What amendments did Pfizer file in 2023?",
  "When was Pfizer's most recent proxy statement filed?",
  "Which company filed more amendments: Google or Meta?",
  "What was Microsoft's filing pattern during Q4 2023?",
  "When did Netflix file its last 10-K annual report?",
  "What amendments did AbbVie file in 2023?",
  "Show me 8-K filing frequency comparison: Apple vs Netflix",
  "Which filed their 10-K earlier: Apple or Oracle?",
  "When was Amazon's most recent proxy statement filed?",
  "Show me the filing timeline comparison between Apple and Intel",
  "When did Amazon file its annual report for fiscal year 2023?",
  "Which company filed more amendments: Apple or Bank of America?",
  "Show me Walmart's quarterly filing timeline for 2022",
  "Show me Tesla's 10-Q quarterly filings in 2023",
  "Show me Johnson & Johnson's 10-Q quarterly filings in 2023",
  "Show me the filing timeline comparison between Apple and Netflix",
  "Which filed their 10-K earlier: Apple or Salesforce?",
  "Show me Procter & Gamble's 10-Q quarterly filings in 2023",
  "Compare Apple and Qualcomm's SEC filing schedules",
  "Show me proxy statement filing patterns relative to annual meetings",
  "When was Procter & Gamble's most recent proxy statement filed?",
  "What was Netflix's filing pattern during Q4 2023?",
  "Show me Adobe's 10-Q quarterly filings in 2023",
  "Compare Apple and AMD's SEC filing schedules",
  "Compare Apple and Bank of America's SEC filing schedules",
  "Show me Pfizer's quarterly filing timeline for 2022",
  "Which filed their 10-K earlier: Apple or AMD?",
  "Show me Qualcomm's 10-Q quarterly filings in 2023",
  "Compare amendment patterns between Apple and Adobe",
  "When did Coca-Cola file its last 10-K annual report?",
  "What was PepsiCo's filing pattern during Q4 2023?",
  "Show me all Morgan Stanley SEC filings in chronological order",
  "Show me 8-K filing frequency comparison: Apple vs Meta",
  "Compare amendment patterns between Apple and Tesla",
  "Which filed their 10-K earlier: Google or Meta?",
  "Compare Apple and NVIDIA's SEC filing schedules",
  "Find companies that filed 10-K and proxy statements within 2 weeks",
  "What amendments did Netflix file in 2023?",
  "Show me Goldman Sachs's quarterly filing timeline for 2022",
  "Compare proxy statement filing dates for Apple and Goldman Sachs",
  "Show me Goldman Sachs's 10-Q quarterly filings in 2023",
  "List all Salesforce filings within 90 days of fiscal year end",
  "Show me Microsoft's quarterly filing timeline for 2022",
  "When did Morgan Stanley file its last 10-K annual report?",
  "Show me all Salesforce SEC filings in chronological order",
  "When did UnitedHealth file its annual report for fiscal year 2023?",
  "Which company has more consistent filing timing: Apple or JPMorgan?",
  "Compare proxy statement filing dates for Apple and Oracle",
  "Which filed their 10-K earlier: Apple or NVIDIA?",
  "Find companies that filed amendments within 30 days of original filing",
  "When was Morgan Stanley's most recent proxy statement filed?",
  "Show me all Qualcomm SEC filings in chronological order",
  "Show me the filing timeline comparison between Apple and Adobe",
  "Show me 8-K filing frequency comparison: Google vs Tesla",
  "Which company has more consistent filing timing: Apple or Meta?",
  "Show me 8-K filing frequency comparison: Apple vs Amazon",
  "What was Johnson & Johnson's filing pattern during Q4 2023?",
  "Show me JPMorgan's 10-Q quarterly filings in 2023",
  "When was Coca-Cola's most recent proxy statement filed?",
  "Which company has more consistent filing timing: Apple or Goldman Sachs?",
  "Which company has more consistent filing timing: Apple or AMD?",
  "When did Microsoft file its annual report for fiscal year 2023?",
  "Compare Apple and Tesla's SEC filing schedules",
  "What was Meta's filing pattern during Q4 2023?",
  "Show me all Meta SEC filings in chronological order",
  "Show me all AMD SEC filings in chronological order",
  "Which company has more consistent filing timing: Apple or Google?",
  "Which filed their 10-K earlier: Apple or Johnson & Johnson?",
  "What amendments did JPMorgan file in 2023?",
  "Which company filed more amendments: Apple or Google?",
  "Show me all Johnson & Johnson SEC filings in chronological order",
  "List all Oracle filings within 90 days of fiscal year end",
  "Show me Bank of America's quarterly filing timeline for 2022",
  "What 8-K current reports did AbbVie submit this year?",
  "Show me Google's quarterly filing timeline for 2022",
  "List all Amazon filings within 90 days of fiscal year end",
  "What 8-K current reports did NVIDIA submit this year?",
  "When was Apple's most recent proxy statement filed?",
  "What 8-K current reports did Merck submit this year?",
  "When did Merck file its last 10-K annual report?",
  "Compare Apple and Netflix's SEC filing schedules",
  "What was Wells Fargo's filing pattern during Q4 2023?",
  "Show me Procter & Gamble's quarterly filing timeline for 2022",
  "Which companies filed the most amendments in 2022?",
  "Compare Google and NVIDIA's SEC filing schedules",
  "Which company has more consistent filing timing: Apple or Intel?",
  "Show me filing patterns around major market events in 2022",
  "When was Bank of America's most recent proxy statement filed?",
  "What was Adobe's filing pattern during Q4 2023?",
  "Show me Netflix's quarterly filing timeline for 2022",
  "Which company has more consistent filing timing: Apple or Bank of America?",
  "Compare amendment patterns between Apple and JPMorgan",
  "Which companies had the most XBRL-formatted filings?",
  "What amendments did Microsoft file in 2023?",
  "Show me 8-K filing frequency comparison: Apple vs Salesforce",
  "Show me the average time between 10-Q filings for each company",
  "What amendments did Bank of America file in 2023?",
  "Show me all UnitedHealth SEC filings in chronological order",
  "Which companies filed amendments most quickly after original submissions?",
  "When did Qualcomm file its annual report for fiscal year 2023?",
  "Compare Apple and Salesforce's SEC filing schedules",
  "List all Merck filings within 90 days of fiscal year end",
  "Show me Meta's 10-Q quarterly filings in 2023",
  "Which company has more consistent filing timing: Apple or Wells Fargo?",
  "What 8-K current reports did UnitedHealth submit this year?",
  "Which filed their 10-K earlier: Google or NVIDIA?",
  "When was AMD's most recent proxy statement filed?",
  "What was Amazon's filing pattern during Q4 2023?",
  "Compare amendment patterns between Apple and Goldman Sachs",
  "What 8-K current reports did Coca-Cola submit this year?",
  "What amendments did Merck file in 2023?",
  "List all Microsoft filings within 90 days of fiscal year end",
  "When did Tesla file its annual report for fiscal year 2023?",
  "Which company filed more amendments: Apple or Adobe?",
  "When was Qualcomm's most recent proxy statement filed?",
  "When did Pfizer file its last 10-K annual report?",
  "When was PepsiCo's most recent proxy statement filed?",
  "What was Google's filing pattern during Q4 2023?",
  "Which filed their 10-K earlier: Apple or Microsoft?",
  "Compare proxy statement filing dates for Google and NVIDIA",
  "Compare Google and Meta's SEC filing schedules",
  "Show me Tesla's quarterly filing timeline for 2022",
  "When was NVIDIA's most recent proxy statement filed?",
  "What was Pfizer's filing pattern during Q4 2023?",
  "Find correlations between filing timing and market volatility periods",
  "Show me AMD's quarterly filing timeline for 2022",
  "Show me the filing timeline comparison between Google and NVIDIA",
  "Compare Apple and Wells Fargo's SEC filing schedules",
  "Show me the filing timeline comparison between Apple and Google",
  "Compare proxy statement filing dates for Apple and NVIDIA",
  "Which company filed more amendments: Apple or Meta?",
  "Show me filing cascades: when one company's filing triggers others",
  "Show me Merck's quarterly filing timeline for 2022",
  "Show me UnitedHealth's 10-Q quarterly filings in 2023",
  "Which filings happened during SEC comment letter periods?",
  "Which company filed more amendments: Apple or Tesla?",
  "List all Google filings within 90 days of fiscal year end",
  "Show me JPMorgan's quarterly filing timeline for 2022",
  "Show me Wells Fargo's quarterly filing timeline for 2022",
  "Which companies filed 10-K and 10-Q within the same week?",
  "Show me Walmart's 10-Q quarterly filings in 2023",
  "List all Adobe filings within 90 days of fiscal year end",
  "Show me Pfizer's 10-Q quarterly filings in 2023",
  "Which company has more consistent filing timing: Apple or Morgan Stanley?",
  "What 8-K current reports did Procter & Gamble submit this year?",
  "Which company has more consistent filing timing: Google or Microsoft?",
  "Which companies have the most consistent 10-Q quarterly filing schedule?",
  "When did Microsoft file its last 10-K annual report?",
  "Which company has more consistent filing timing: Google or Meta?",
  "Compare proxy statement filing dates for Apple and JPMorgan",
  "Which company filed more amendments: Apple or Microsoft?",
  "Show me 8-K filing frequency comparison: Apple vs Intel",
  "Show me AMD's 10-Q quarterly filings in 2023",
  "Compare proxy statement filing dates for Apple and Morgan Stanley",
  "When was AbbVie's most recent proxy statement filed?",
  "Show me the filing timeline for companies with fiscal year changes",
  "What 8-K current reports did Qualcomm submit this year?",
  "Which company has more consistent filing timing: Apple or Tesla?",
  "Compare proxy statement filing dates for Apple and Wells Fargo",
  "When did Bank of America file its annual report for fiscal year 2023?",
  "Show me all Amazon SEC filings in chronological order",
  "Show me 8-K filing frequency comparison: Google vs NVIDIA",
  "Compare proxy statement filing dates for Apple and Meta",
  "What was Coca-Cola's filing pattern during Q4 2023?",
  "Which company filed more amendments: Google or Amazon?",
  "What 8-K current reports did Morgan Stanley submit this year?",
  "When did JPMorgan file its annual report for fiscal year 2023?",
  "List all UnitedHealth filings within 90 days of fiscal year end",
  "What 8-K current reports did Goldman Sachs submit this year?",
  "List all AMD filings within 90 days of fiscal year end",
  "What 8-K current reports did Home Depot submit this year?",
  "Show me all Intel SEC filings in chronological order",
  "Show me Google's 10-Q quarterly filings in 2023",
  "Which company has more consistent filing timing: Apple or Amazon?",
  "Show me the filing timeline comparison between Apple and Amazon",
  "Compare amendment patterns between Google and Microsoft",
  "Compare proxy statement filing dates for Google and Meta",
  "Compare Apple and Morgan Stanley's SEC filing schedules",
  "What was NVIDIA's filing pattern during Q4 2023?",
  "When did Morgan Stanley file its annual report for fiscal year 2023?",
  "Show me Microsoft's 10-Q quarterly filings in 2023",
  "Compare proxy statement filing dates for Apple and Adobe",
  "Show me all Coca-Cola SEC filings in chronological order",
  "Compare amendment patterns between Apple and NVIDIA",
  "Compare Apple and Amazon's SEC filing schedules",
  "What 8-K current reports did Amazon submit this year?",
  "Show me the filing timeline comparison between Google and Microsoft",
  "Find filing clusters: companies filing within 48 hours of each other",
  "Show me 8-K filing frequency comparison: Apple vs Adobe",
  "List all Intel filings within 90 days of fiscal year end",
  "Which companies filed beneficial ownership reports after stock movements?",
  "What was Apple's filing pattern during Q4 2023?",
  "Compare amendment patterns between Google and Amazon",
  "Show me the filing timeline comparison between Google and Tesla",
  "Show me all NVIDIA SEC filings in chronological order",
  "Show me the filing timeline comparison between Apple and AMD",
  "Compare amendment patterns between Apple and Meta",
  "When did Apple file its last 10-K annual report?",
  "When did JPMorgan file its last 10-K annual report?",
  "Show me all Tesla SEC filings in chronological order",
  "When did UnitedHealth file its last 10-K annual report?",
  "When was JPMorgan's most recent proxy statement filed?",
  "Show me companies that consistently meet all SEC filing deadlines",
  "Compare amendment patterns between Apple and Netflix",
  "Show me all AbbVie SEC filings in chronological order",
  "What amendments did AMD file in 2023?",
  "When did Johnson & Johnson file its last 10-K annual report?",
  "What 8-K current reports did Netflix submit this year?",
  "Show me all Apple SEC filings in chronological order",
  "Compare proxy statement filing dates for Apple and AMD",
  "Show me all Adobe SEC filings in chronological order",
  "Show me 8-K filing frequency comparison: Apple vs NVIDIA",
  "Compare proxy statement filing dates for Google and Tesla",
  "Compare amendment patterns between Google and NVIDIA",
  "What amendments did Google file in 2023?",
  "When did AMD file its annual report for fiscal year 2023?",
  "When was Salesforce's most recent proxy statement filed?",
  "When was UnitedHealth's most recent proxy statement filed?",
  "When did AMD file its last 10-K annual report?",
  "Compare amendment patterns between Google and Meta",
  "List all Apple filings within 90 days of fiscal year end",
  "Show me Home Depot's quarterly filing timeline for 2022",
  "Show me companies with the most 8-K current reports in 2023",
  "When did PepsiCo file its last 10-K annual report?",
  "When was Oracle's most recent proxy statement filed?",
  "Show me the filing timeline comparison between Google and Meta",
  "List all Morgan Stanley filings within 90 days of fiscal year end",
  "Compare Apple and Oracle's SEC filing schedules",
  "Show me all Procter & Gamble SEC filings in chronological order",
  "What 8-K current reports did Wells Fargo submit this year?",
  "When did Wells Fargo file its last 10-K annual report?",
  "Show me 8-K filing frequency comparison: Apple vs Johnson & Johnson",
  "When was Walmart's most recent proxy statement filed?",
  "What 8-K current reports did Oracle submit this year?",
  "Show me all 8-K filings within 5 days of quarterly earnings periods",
  "When was Adobe's most recent proxy statement filed?",
  "When did NVIDIA file its last 10-K annual report?",
  "Compare proxy statement filing dates for Google and Amazon",
  "What amendments did Johnson & Johnson file in 2023?",
  "What amendments did Wells Fargo file in 2023?",
  "Show me PepsiCo's quarterly filing timeline for 2022",
  "Which filed their 10-K earlier: Apple or Netflix?",
  "Compare Apple and Intel's SEC filing schedules",
  "What 8-K current reports did Intel submit this year?",
  "Which filed their 10-K earlier: Apple or Adobe?",
  "What 8-K current reports did Microsoft submit this year?",
  "Show me Intel's 10-Q quarterly filings in 2023",
  "Compare proxy statement filing dates for Apple and Netflix",
  "Show me Qualcomm's quarterly filing timeline for 2022",
  "When did Pfizer file its annual report for fiscal year 2023?",
  "What was Bank of America's filing pattern during Q4 2023?",
  "Compare proxy statement filing dates for Google and Netflix",
  "Find the relationship between filing timing and stock price changes",
  "Compare Apple and Goldman Sachs's SEC filing schedules",
  "Which companies filed 10-K within 60 days of fiscal year end in 2023?",
  "Which filed their 10-K earlier: Apple or Intel?",
  "Which company filed more amendments: Apple or Morgan Stanley?",
  "Which companies filed during SEC examination periods?",
  "Show me the filing timeline comparison between Apple and Wells Fargo",
  "Which companies filed their 10-K annual reports late in 2023?",
  "Which company has more consistent filing timing: Apple or NVIDIA?",
  "Which company filed more amendments: Apple or AMD?",
  "List all Pfizer filings within 90 days of fiscal year end",
  "Compare Apple and Adobe's SEC filing schedules",
  "Show me Intel's quarterly filing timeline for 2022",
  "Which company filed more amendments: Apple or Oracle?",
  "What was Oracle's filing pattern during Q4 2023?",
  "Show me 8-K filing frequency comparison: Apple vs JPMorgan",
  "Show me the filing timeline comparison between Apple and Microsoft",
  "Compare amendment patterns between Apple and Bank of America",
  "Which filed their 10-K earlier: Apple or Amazon?",
  "What amendments did Goldman Sachs file in 2023?",
  "Show me Meta's quarterly filing timeline for 2022",
  "When did Meta file its annual report for fiscal year 2023?",
  "Show me the filing timeline comparison between Apple and Morgan Stanley",
  "Show me 8-K filing frequency comparison: Google vs Microsoft",
  "Show me AbbVie's 10-Q quarterly filings in 2023",
  "When did Google file its annual report for fiscal year 2023?",
  "Which company has more consistent filing timing: Google or Tesla?",
  "When was Tesla's most recent proxy statement filed?",
  "What 8-K current reports did Bank of America submit this year?",
  "Find companies with overlapping SEC filing deadlines",
  "List all Home Depot filings within 90 days of fiscal year end",
  "Show me 8-K filing frequency comparison: Apple vs Goldman Sachs",
  "What 8-K current reports did Apple submit this year?",
  "Compare proxy statement filing dates for Apple and Microsoft",
  "Which company has more consistent filing timing: Google or Amazon?",
  "What was Salesforce's filing pattern during Q4 2023?",
  "Find temporal patterns in insider trading form submissions",
  "Compare amendment patterns between Apple and Wells Fargo",
  "Show me the filing timeline comparison between Apple and Salesforce",
  "Compare Apple and Johnson & Johnson's SEC filing schedules",
  "Show me all Microsoft SEC filings in chronological order",
  "Show me companies that consistently meet SEC filing deadlines",
  "Show me the filing timeline comparison between Apple and Bank of America",
  "What was AMD's filing pattern during Q4 2023?",
  "When did Meta file its last 10-K annual report?",
  "List all AbbVie filings within 90 days of fiscal year end",
  "Show me filing patterns during earnings season in Q1 2023",
  "When did Walmart file its annual report for fiscal year 2023?",
  "Compare amendment patterns between Apple and Oracle",
  "Show me Amazon's quarterly filing timeline for 2022",
  "Which filed their 10-K earlier: Apple or Bank of America?",
  "When did Adobe file its annual report for fiscal year 2023?",
  "When did Johnson & Johnson file its annual report for fiscal year 2023?",
  "Which filed their 10-K earlier: Apple or Morgan Stanley?",
  "When did Walmart file its last 10-K annual report?",
  "Compare proxy statement filing dates for Apple and Qualcomm",
  "When did Oracle file its annual report for fiscal year 2023?",
  "Compare amendment patterns between Apple and Qualcomm",
  "What was Goldman Sachs's filing pattern during Q4 2023?",
  "Which company has more consistent filing timing: Apple or Salesforce?",
  "Show me Oracle's quarterly filing timeline for 2022",
  "When was Netflix's most recent proxy statement filed?",
  "What was Intel's filing pattern during Q4 2023?",
  "Show me the filing timeline comparison between Apple and NVIDIA",
  "When was Home Depot's most recent proxy statement filed?",
  "Show me seasonal patterns in SEC filing submissions",
  "What amendments did Walmart file in 2023?",
  "Which company filed more amendments: Apple or JPMorgan?",
  "Show me the filing timeline comparison between Google and Netflix",
  "List all Johnson & Johnson filings within 90 days of fiscal year end",
  "When did Salesforce file its last 10-K annual report?",
  "What amendments did NVIDIA file in 2023?",
  "When did Amazon file its last 10-K annual report?",
  "When did PepsiCo file its annual report for fiscal year 2023?",
  "When was Meta's most recent proxy statement filed?",
  "Show me Salesforce's quarterly filing timeline for 2022",
  "What was Tesla's filing pattern during Q4 2023?",
  "Which filed their 10-K earlier: Apple or Wells Fargo?",
  "Compare proxy statement filing dates for Apple and Google",
  "Compare proxy statement filing dates for Apple and Johnson & Johnson",
  "Compare amendment patterns between Apple and Amazon",
  "Which company filed more amendments: Apple or Amazon?",
  "List all Meta filings within 90 days of fiscal year end",
  "What was Morgan Stanley's filing pattern during Q4 2023?",
  "What amendments did Qualcomm file in 2023?",
  "What amendments did Oracle file in 2023?",
  "Show me filing patterns for newly public companies",
  "List all Qualcomm filings within 90 days of fiscal year end",
  "Which company filed more amendments: Google or NVIDIA?",
  "Show me all Walmart SEC filings in chronological order",
  "Show me all Goldman Sachs SEC filings in chronological order",
  "When did Merck file its annual report for fiscal year 2023?",
  "Which company filed more amendments: Apple or Salesforce?",
  "Which company filed more amendments: Apple or NVIDIA?",
  "Which filed their 10-K earlier: Google or Microsoft?",
  "When did Wells Fargo file its annual report for fiscal year 2023?",
  "What was AbbVie's filing pattern during Q4 2023?",
  "Show me the filing timeline comparison between Google and Amazon",
  "What was Home Depot's filing pattern during Q4 2023?",
  "Compare Apple and Google's SEC filing schedules",
  "Show me 8-K filing frequency comparison: Google vs Netflix",
  "Show me all PepsiCo SEC filings in chronological order",
  "List all Wells Fargo filings within 90 days of fiscal year end",
  "List all Tesla filings within 90 days of fiscal year end",
  "Compare amendment patterns between Apple and Salesforce",
  "Show me the filing timeline comparison between Apple and Goldman Sachs",
  "Show me all Pfizer SEC filings in chronological order",
  "Which company has more consistent filing timing: Apple or Netflix?",
  "Which company has more consistent filing timing: Google or NVIDIA?",
  "What was Procter & Gamble's filing pattern during Q4 2023?",
  "What 8-K current reports did AMD submit this year?",
  "Show me 8-K filing frequency comparison: Apple vs Microsoft",
  "Show me the filing timeline comparison between Apple and Qualcomm",
  "Show me all JPMorgan SEC filings in chronological order",
  "Compare amendment patterns between Google and Netflix",
  "Show me Coca-Cola's 10-Q quarterly filings in 2023",
  "Show me all Wells Fargo SEC filings in chronological order",
  "When did Google file its last 10-K annual report?",
  "Which filed their 10-K earlier: Apple or Meta?",
  "Compare Apple and JPMorgan's SEC filing schedules",
  "List all Walmart filings within 90 days of fiscal year end",
  "Which filed their 10-K earlier: Apple or JPMorgan?",
  "Show me all Bank of America SEC filings in chronological order",
  "Show me 8-K filing frequency comparison: Apple vs Tesla",
  "What was Walmart's filing pattern during Q4 2023?",
  "Show me all Netflix SEC filings in chronological order",
  "When did Procter & Gamble file its last 10-K annual report?",
  "When was Goldman Sachs's most recent proxy statement filed?",
  "What 8-K current reports did Meta submit this year?",
  "Which company filed more amendments: Apple or Intel?",
  "Show me filing size patterns: largest vs smallest submissions",
  "Compare Google and Amazon's SEC filing schedules",
  "Find all companies that filed 8-K reports on the same day",
  "What 8-K current reports did Adobe submit this year?",
  "Show me Oracle's 10-Q quarterly filings in 2023",
  "Which company filed more amendments: Apple or Goldman Sachs?",
  "Show me 8-K filing frequency comparison: Apple vs AMD",
  "When did NVIDIA file its annual report for fiscal year 2023?",
  "List all Netflix filings within 90 days of fiscal year end",
  "What amendments did Tesla file in 2023?",
  "Which company has more consistent filing timing: Apple or Johnson & Johnson?",
  "What amendments did Apple file in 2023?"
]